{
  "src/App.jsx": "This is the main application component that serves as the root of the Iowa Print Solutions website. It sets up the routing structure using React Router, defining the main navigation paths for Home, Services, About, and Contact pages. The component includes the persistent Navbar and Footer components that appear on all pages, while the main content area dynamically renders different pages based on the current route. Keywords: ['React', 'Router', 'Navigation', 'App Structure', 'SPA']. component_type: ['layout']. functionality: ['Sets up the main application structure with routing and persistent layout components']. use_case: ['Main entry point for the application', 'Defines overall page structure and navigation']. related_files: ['src/main.jsx', 'src/components/Navbar.jsx', 'src/components/Footer.jsx', 'src/pages/Home.jsx']",
  "src/components/Navbar.jsx": "This is the main navigation component for the Iowa Print Solutions website. It provides a responsive navigation bar with a logo, menu items, and mobile hamburger menu. The component handles navigation between different pages including Home, Services, About, and Contact. It also includes a Resources dropdown menu that links to various articles about print management solutions. The navbar is sticky and includes smooth animations using Framer Motion. Keywords: ['navigation', 'navbar', 'responsive', 'menu', 'resources', 'dropdown']. component_type: ['layout']. functionality: ['Provides main navigation for the website with responsive design and dropdown menu for resources']. use_case: ['Main site navigation', 'Mobile menu', 'Resource article access']. related_files: ['src/App.jsx', 'src/pages/Home.jsx', 'src/pages/Services.jsx']",
  "src/components/Footer.jsx": "This file contains the footer component for the Iowa Print Solutions website. It displays company information, services list, and contact details in a structured layout with a dark theme. The footer includes the company logo, description, service offerings, and contact information with icons. Keywords: ['footer', 'contact', 'services', 'company info', 'navigation']. component_type: ['UI']. functionality: ['Displays footer section with company information and contact details']. use_case: ['Website footer', 'Contact information display', 'Service listing']. related_files: ['src/App.jsx', 'src/components/Navbar.jsx']",
  "src/components/Hero.jsx": "This is the main hero component that serves as the primary landing section for the Iowa Print Solutions website. It features a compelling headline, key benefits, and call-to-action buttons to engage visitors immediately upon arrival. The component uses Framer Motion for smooth animations and includes contact information and service highlights. Keywords: ['hero', 'landing', 'print-solutions', 'iowa', 'papercut', 'uniflow', 'printerlogic']. component_type: ['UI']. functionality: ['Displays the main value proposition and key services offered by Iowa Print Solutions with animated elements and call-to-action buttons']. use_case: ['Homepage landing section', 'Primary visitor engagement', 'Service introduction']. related_files: ['src/pages/Home.jsx', 'src/components/Navbar.jsx']",
  "src/components/ServiceCard.jsx": "A reusable service card component that displays individual services offered by Iowa Print Solutions. Each card includes an icon, title, description, feature list, and a call-to-action button. The component is designed to be flexible and can be used across different pages to showcase various print management services. Keywords: ['service-card', 'component', 'reusable', 'print-services', 'ui-element']. component_type: ['UI']. functionality: ['Displays service information in a structured card format with hover effects and animations']. use_case: ['Services page display', 'Homepage service showcase', 'Feature highlighting']. related_files: ['src/pages/Services.jsx', 'src/pages/Home.jsx']",
  "src/components/TestimonialCard.jsx": "A testimonial card component that showcases client feedback and reviews for Iowa Print Solutions. The component displays customer quotes, ratings, company information, and location details in an attractive card format. It includes star ratings and professional styling to build trust and credibility. Keywords: ['testimonial', 'review', 'client-feedback', 'trust-building', 'social-proof']. component_type: ['UI']. functionality: ['Displays customer testimonials with ratings and company information in a visually appealing card format']. use_case: ['Homepage testimonials section', 'About page client reviews', 'Trust building elements']. related_files: ['src/pages/Home.jsx', 'src/pages/About.jsx']",
  "src/pages/Home.jsx": "This is the main homepage component for Iowa Print Solutions website. It displays the hero section, services overview, testimonials, and call-to-action sections. The file uses React with Framer Motion for animations and Tailwind CSS for styling. It serves as the landing page that introduces visitors to the company's print management services and expertise. Keywords: ['homepage', 'hero', 'services', 'testimonials', 'landing-page']. component_type: ['layout']. functionality: ['Displays the main homepage with hero section, services overview, and testimonials for Iowa Print Solutions']. use_case: ['Main landing page for website visitors', 'First impression and overview of services']. related_files: ['src/components/Hero.jsx', 'src/components/ServiceCard.jsx', 'src/components/TestimonialCard.jsx']",
  "src/pages/Services.jsx": "This is the comprehensive services page that details all print management solutions offered by Iowa Print Solutions. It showcases six main service categories including PaperCut, Uniflow, PrinterLogic, security solutions, optimization, and ongoing support. Each service is presented with detailed features and benefits, concluding with a strong call-to-action section to drive conversions. Keywords: ['Services', 'PaperCut', 'Uniflow', 'PrinterLogic', 'Print Management']. component_type: ['layout']. functionality: ['Services page that displays detailed information about all print management solutions with features and call-to-action']. use_case: ['Service showcase', 'Lead generation', 'Detailed information']. related_files: ['src/components/ServiceCard.jsx', 'src/App.jsx']",
  "src/pages/About.jsx": "The About page component provides comprehensive information about Iowa Print Solutions, including company history, values, timeline, certifications, and team information. It showcases the company's expertise and experience in print management solutions while building trust with potential clients through detailed background information and credentials. Keywords: ['about', 'company-info', 'history', 'team', 'certifications', 'iowa-print-solutions']. component_type: ['layout']. functionality: ['Displays company information, history, values, and team details in an engaging format with animations and structured sections']. use_case: ['About page navigation', 'Company credibility building', 'Team introduction']. related_files: ['src/App.jsx', 'src/components/Navbar.jsx', 'src/pages/Contact.jsx']",
  "src/main.jsx": "This is the entry point file that renders the React application to the DOM. It imports the main App component and the global CSS styles, then creates a React root and renders the App component within React's StrictMode for better development experience and error detection. This file is essential for bootstrapping the entire application. Keywords: ['React', 'DOM', 'Entry Point', 'Render', 'StrictMode']. component_type: ['functional']. functionality: ['Initializes and renders the React application to the browser DOM']. use_case: ['Application startup', 'DOM mounting', 'Development mode setup']. related_files: ['src/App.jsx', 'src/index.css', 'index.html']",
  "src/index.css": "This is the main stylesheet that defines the global styles for the Iowa Print Solutions website. It includes Tailwind CSS directives for base styles, components, and utilities, imports the Inter font from Google Fonts, and sets up global CSS reset and base styling. The file also defines custom button classes for consistent styling across the application. Keywords: ['CSS', 'Tailwind', 'Styling', 'Typography', 'Global Styles']. component_type: ['stylesheet']. functionality: ['Provides global styling and Tailwind CSS configuration for the entire application']. use_case: ['Global styling', 'Typography setup', 'Consistent design system']. related_files: ['tailwind.config.js', 'postcss.config.js', 'src/main.jsx']",
  "tailwind.config.js": "This is the Tailwind CSS configuration file that customizes the design system for the Iowa Print Solutions website. It defines the content paths for CSS purging, extends the default theme with custom primary (blue) and secondary (green) color palettes, and sets Inter as the default sans-serif font. This configuration ensures consistent branding and styling throughout the application. Keywords: ['Tailwind', 'CSS', 'Configuration', 'Theme', 'Colors']. component_type: ['stylesheet']. functionality: ['Configures Tailwind CSS theme and design system for the application']. use_case: ['Design system setup', 'Color palette definition', 'Typography configuration']. related_files: ['src/index.css', 'postcss.config.js']",
  "postcss.config.js": "This is the PostCSS configuration file that sets up CSS processing plugins for the Iowa Print Solutions project. It enables Tailwind CSS processing and Autoprefixer for automatic vendor prefix addition, ensuring cross-browser compatibility and proper CSS compilation. This configuration is essential for the Tailwind CSS build process. Keywords: ['PostCSS', 'CSS Processing', 'Tailwind', 'Autoprefixer', 'Build']. component_type: ['functional']. functionality: ['Configures CSS processing pipeline with Tailwind and browser compatibility features']. use_case: ['CSS compilation', 'Browser compatibility', 'Build process']. related_files: ['tailwind.config.js', 'src/index.css', 'vite.config.js']",
  "vite.config.js": "This is the Vite configuration file that sets up the build tool settings for the Iowa Print Solutions project. It configures the React plugin, sets the development server to run on port 3000 with host accessibility, and optimizes the build process with ESBuild minification. This configuration ensures fast development and efficient production builds. Keywords: ['Vite', 'Build Tool', 'Configuration', 'React Plugin', 'Server']. component_type: ['functional']. functionality: ['Configures the Vite build tool for development and production environments']. use_case: ['Development server setup', 'Build optimization', 'Plugin configuration']. related_files: ['package.json', 'src/main.jsx']",
  "index.html": "This is the main HTML template file that serves as the foundation for the single-page application. It includes essential meta tags for SEO optimization, sets the page title specifically for Iowa Print Solutions, and provides a description highlighting the company's expertise in print management solutions. The file also includes the root div where the React application will be mounted. Keywords: ['HTML', 'Template', 'SEO', 'Meta Tags', 'SPA']. component_type: ['layout']. functionality: ['Provides the HTML foundation and SEO setup for the React application']. use_case: ['SEO optimization', 'Application mounting point', 'Browser compatibility']. related_files: ['src/main.jsx', 'vite.config.js']",
  "package.json": "This is the main configuration file for the Node.js project that defines project metadata, dependencies, and npm scripts. It contains essential information about the project including its name, version, dependencies needed to run the application, and various scripts that can be executed via npm commands. The file is crucial for package management and project setup, allowing developers to install dependencies and run development or build commands. Keywords: ['package.json', 'npm', 'dependencies', 'scripts', 'node.js', 'project configuration']. component_type: ['configuration']. functionality: ['Defines project metadata, dependencies, and executable scripts for the npm package manager']. use_case: ['Project initialization', 'dependency management', 'script execution', 'deployment configuration']. related_files: ['vite.config.js', 'tailwind.config.js', 'postcss.config.js']",
  "src/pages/Contact.jsx": "This is the main contact page component for the Iowa Print Solutions website. It provides a comprehensive contact form for potential clients to reach out for consultations, displays contact information including phone and email, and includes a call-to-action section with links to schedule appointments. The page features a professional layout with form validation, service selection dropdown, and detailed contact information cards. Keywords: ['contact', 'form', 'consultation', 'Iowa', 'print solutions', 'calendly', 'phone', 'email']. component_type: ['page']. functionality: ['Displays contact form for client inquiries and consultation requests']. use_case: ['Client contact and lead generation', 'Service inquiry submissions', 'Consultation scheduling']. related_files: ['src/components/Navbar.jsx', 'src/App.jsx', 'src/pages/Home.jsx']",
  "src/pages/services/PaperCutService.jsx": "This is a comprehensive service page specifically for PaperCut MF implementation services. The page provides detailed information about PaperCut solutions including features, benefits, implementation process, and statistics. It serves as a dedicated landing page for users interested in PaperCut services, featuring sections for service overview, key features with icons, benefits checklist, implementation statistics, step-by-step process timeline, and call-to-action sections. The page uses animations and responsive design to create an engaging user experience while providing all necessary information for potential clients to understand the PaperCut implementation service. Keywords: ['PaperCut', 'implementation', 'print management', 'cost reduction', 'security', 'mobile printing', 'Iowa', 'assessment', 'ROI']. component_type: ['UI', 'service page']. functionality: ['Displays comprehensive information about PaperCut MF implementation services with features, benefits, process steps, and contact options']. use_case: ['Service detail page for PaperCut implementation', 'Lead generation for print management services', 'Information resource for potential clients']. related_files: ['src/App.jsx', 'src/components/ServiceCard.jsx', 'src/pages/Services.jsx']",
  "src/pages/services/UniflowService.jsx": "This is a dedicated service page for Uniflow document workflow solutions. The page provides comprehensive information about Uniflow's capabilities including document automation, secure printing, mobile integration, and custom workflow creation. It features sections highlighting key features with icons, benefits for Iowa organizations, popular workflow examples, integration capabilities with various business systems, and call-to-action sections. The page uses green color theming to differentiate from other services and includes animations for enhanced user experience. It serves as a detailed resource for potential clients interested in document workflow automation. Keywords: ['Uniflow', 'document workflows', 'automation', 'secure printing', 'mobile integration', 'business systems', 'Iowa', 'scanning', 'routing']. component_type: ['UI', 'service page']. functionality: ['Displays detailed information about Uniflow document workflow solutions with features, benefits, integrations, and contact options']. use_case: ['Service detail page for Uniflow solutions', 'Lead generation for document workflow services', 'Information resource for workflow automation']. related_files: ['src/App.jsx', 'src/components/ServiceCard.jsx', 'src/pages/Services.jsx']",
  "src/pages/resources/PaperCutImplementationGuide.jsx": "This comprehensive guide provides Iowa businesses with a detailed roadmap for implementing PaperCut MF print management solutions. The component covers the complete 6-step implementation process, from initial assessment to go-live, addressing common challenges and providing practical solutions. It includes timeline estimates for different organization sizes and emphasizes the benefits specific to Iowa businesses. The guide serves as both an educational resource and a lead generation tool, encouraging visitors to contact the Iowa-based implementation experts. Keywords: ['PaperCut', 'implementation', 'Iowa', 'print management', 'guide', 'step-by-step', 'deployment']. Component type: ['educational resource']. Functionality: ['Provides detailed implementation guidance for PaperCut MF with Iowa-specific context and expert consultation calls-to-action']. Use case: ['Educational content for businesses considering PaperCut implementation', 'Lead generation through expert consultation offers']. Related files: ['src/pages/services/PaperCutService.jsx', 'src/components/Navbar.jsx']",
  "src/pages/resources/PaperCutCostReduction.jsx": "This resource page focuses specifically on cost reduction strategies using PaperCut print management for Iowa businesses. It provides detailed information about various cost-saving features, real case studies from Iowa organizations, and quantifiable savings data. The component includes interactive elements showing potential savings calculations and implementation steps. It serves as both an educational resource and a lead generation tool by demonstrating the financial benefits of PaperCut implementation. Keywords: ['PaperCut', 'cost reduction', 'Iowa', 'print savings', 'ROI', 'budget control', 'print management']. Component type: ['educational resource']. Functionality: ['Provides detailed cost reduction strategies and real Iowa business case studies with consultation calls-to-action']. Use case: ['Educational content for businesses looking to reduce print costs', 'Lead generation through cost analysis offers']. Related files: ['src/pages/services/PaperCutService.jsx', 'src/components/Navbar.jsx']",
  "src/pages/resources/PaperCutSecurityPractices.jsx": "This file creates a comprehensive resource page focused on PaperCut print security best practices specifically for Iowa organizations. The page covers essential security features like secure print release, user access controls, print monitoring, and document security policies. It addresses common security threats and provides detailed solutions, compliance requirements for Iowa businesses including HIPAA, FERPA, and SOX regulations, and implementation best practices. The content is optimized for Iowa SEO with local references and includes clear calls-to-action for security assessments and consultations. Keywords: ['PaperCut', 'print security', 'Iowa businesses', 'secure printing', 'compliance', 'document protection', 'authentication', 'audit trails']. component_type: ['UI']. functionality: ['Displays comprehensive print security information and best practices for Iowa organizations using PaperCut solutions']. use_case: ['Educational resource for Iowa businesses seeking print security solutions', 'Lead generation for security consulting services']. related_files: ['src/pages/resources/PaperCutImplementationGuide.jsx', 'src/components/Navbar.jsx']",
  "src/pages/resources/PaperCutMobilePrinting.jsx": "This file creates a comprehensive resource page about PaperCut mobile printing solutions specifically for Iowa businesses. The page covers mobile printing capabilities including PaperCut Mobility Print, web print interfaces, wireless print release, and BYOD integration. It provides detailed implementation steps, mobile applications overview, and quantifiable business benefits. The content includes success metrics and is optimized for Iowa SEO with local business references and clear calls-to-action for mobile printing setup and demonstrations. Keywords: ['PaperCut', 'mobile printing', 'Iowa businesses', 'BYOD', 'wireless printing', 'smartphone printing', 'productivity', 'mobility print']. component_type: ['UI']. functionality: ['Displays comprehensive mobile printing information and implementation guidance for Iowa organizations']. use_case: ['Educational resource for Iowa businesses seeking mobile printing solutions', 'Lead generation for mobile printing services']. related_files: ['src/pages/resources/PaperCutImplementationGuide.jsx', 'src/components/Navbar.jsx']"
}